import { BlogDataType, FaqsType, FoodMenuItemType, IntrductionType } from "../Types/DataType";

export const BlogData = [
  {
    id: 1,
    title: "سلام دنیا!",
    desc: "به وردپرس خوش آمدید. این اولین نوشتهٔ شماست. این را ویرایش یا حذف کنید، سپس نوشتن را شروع نمایید!",
    image: "https://t-theme.com/foodking/wp-content/uploads/2024/03/05.jpg"
  },
  {
    id: 2,
    title: "آشپزی چارنیکلز در حال کاوش در شگفتی های غذا در رستوران فودکینگ",
    desc: "لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از طراحان گرافیک است، چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان...",
    image: "https://t-theme.com/foodking/wp-content/uploads/2024/02/post-inner.jpg"
  },
  {
    id: 3,
    title: "سمفونی مرزه: برگر اکستراواگانزا لذیذ",
    desc: "لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از طراحان گرافیک است، چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان...",
    image: "https://t-theme.com/foodking/wp-content/uploads/2024/03/06-1.jpg"
  },
  {
    id: 4,
    title: "جذابیت پنیر: لذت پیتزا ایتالیایی مقاومت ناپذیر",
    desc: "لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از طراحان گرافیک است، چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است، و برای شرایط فعلی تکنولوژی مورد نیاز، و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد، کتابهای زیادی در شصت و سه درصد گذشته حال و آینده، شناخت فراوان جامعه و متخصصان را می طلبد، تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه ای علی الخصوص طراحان خلاقی، و فرهنگ پیشرو در زبان فارسی ایجاد کرد، در این صورت می توان امید داشت که تمام و دشواری موجود در ارائه راهکارها، و شرایط سخت تایپ به پایان رسد و زمان مورد نیاز شامل حروفچینی دستاوردهای اصلی، و جوابگوی سوالات پیوسته اهل دنیای موجود طراحی اساسا مورد استفاده قرار گیرد.",
    image: "https://t-theme.com/foodking/wp-content/uploads/2024/02/04-4.jpg"
  }
] as BlogDataType[];

export const FaqsData = [
  {
    title: "آیا قیمت های منوی شما با قیمت های رستوران یکی است؟",
    content: "متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از طراحان گرافیک است، چاپ"
  },
  {
    title: "متن ساختگی با تولید سادگی نامفهوم",
    content: "متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از طراحان گرافیک است، چاپ"
  },
  {
    title: "متن ساختگی با تولید سادگی نامفهوم",
    content: "متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از طراحان گرافیک است، چاپ"
  },
  {
    title: "متن ساختگی با تولید سادگی نامفهوم",
    content: "متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از طراحان گرافیک است، چاپ"
  },
  {
    title: "متن ساختگی با تولید سادگی نامفهوم",
    content: "متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از طراحان گرافیک است، چاپ"
  }
] as FaqsType[];

export const InterItemData = [
  {
    id: 1,
    title: "غذای فوق‌العاده با کیفیت",
    content: "تیمی متشکل از رویاپردازان و انجام دهندگان موسیقی و هنر تعاملی منحصر به فرد را ایجاد می‌کنند."
  },
  {
    id: 2,
    title: "شهرت خوب",
    content: "تیمی متشکل از رویاپردازان و انجام دهندگان موسیقی و هنر تعاملی منحصر به فرد را ایجاد می‌کنند."
  }
] as IntrductionType[];

export const BlogBoxData = [
  {
    id: 1,
    Title: "نوشته‌های تازه",
    contens: [
      { link: "سلام دنیا!" },
      { link: "شگفتی های غذا در رستوران فودکینگ" },
      { link: "آشپزی چارنیکلز در حال کاوش در شگفتی های غذا در رستوران" },
      { link: "نیش پررنگ: طعم های عجیب و غریب، ماجراجویی جهانی" },
      { link: "هوس های سریع: از بین بردن لذت های فست فود" }
    ]
  },
  {
    id: 2,
    Title: "نوشته‌های تازه",
    contens: [
      { type: "text", link: "آخرین دیدگاه‌ها" },
      { type: "comment", author: "foodking", post: "هوس های سریع: از بین بردن لذت های فست فود" },
      { type: "comment", author: "یک نویسنده دیدگاه وردپرس", post: "سلام دنیا!" },
      { type: "comment", author: "foodking", post: "هوپر برگر کینگ" },
      { type: "comment", author: "foodking", post: "روتی با مرغ" },
      { type: "comment", author: "foodking", post: "مرغ کبابی" }
    ]
  },
  {
    id: 3,
    Title: "بایگانی‌ها",
    contens: [{ link: "جولای 2024" }]
  },
  {
    id: 4,
    Title: "دسته‌ها",
    contens: [
      { link: "برنج کبابی" },
      { link: "پاستا" },
      { link: "پیتزا داغ" },
      { link: "دسته‌بندی نشده" },
      { link: "ساندویچ" },
      { link: "فست فود" },
      { link: "مرغ سوخاری" },
      { link: "نان" },
      { link: "هات داگ" }
    ]
  }
] as BlogDataType[];

export const FoodMenuItems = [
  {
    id: 1,
    title: 'پیتزا دیپ شیکاگو',
    desc: 'این تجربه ناهار خوری عالی است که در آن تجربه سریع و کارآمد را داشته باشید',
    price: '۲۲تومان',
  },
  {
    id: 2,
    title: 'برگر کلاسیک ذغالی',
    desc: 'ترکیبی از گوشت گریل‌شده، پنیر چدار و سس مخصوص',
    price: '۱۸تومان',
  },
  {
    id: 3,
    title: 'سالاد سزار با مرغ',
    desc: 'سالادی سبک با مرغ گریل‌شده، نان تست و سس مخصوص',
    price: '۱۴تومان',
  },
  {
    id: 4,
    title: 'پاستا آلفردو',
    desc: 'پاستا خامه‌ای با مرغ و قارچ در سس آلفردو',
    price: '۲۵تومان',
  },
  {
    id: 5,
    title: 'چیز برگر دوبل',
    desc: 'دو لایه گوشت، دو لایه پنیر، سس مخصوص و نان نرم',
    price: '۲۷تومان',
  },
  {
    id: 6,
    title: 'هات‌داگ ویژه',
    desc: 'هات‌داگ بزرگ با پنیر، چیلی، و ترشی مخصوص',
    price: '۱۵تومان',
  },
  {
    id: 7,
    title: 'مرغ سوخاری اسپایسی',
    desc: 'مرغ تند و سوخاری با طعمی بی‌نظیر',
    price: '۲۰تومان',
  },
  {
    id: 8,
    title: 'کباب لقمه زعفرانی',
    desc: 'کباب سنتی ایرانی با عطر زعفران و کره',
    price: '۳۲تومان',
  },
] as FoodMenuItemType[];

export const faMonths = ["فروردین", "اردیبهشت", "خرداد", "تیر", "مرداد", "شهریور", "مهر", "آبان", "آذر", "دی", "بهمن", "اسفند"];
export const faDays = ["ش", "ی", "د", "س", "چ", "پ", "ج"];

export const testimonials = [
  {
    name: "امیلیا امیلی",
    role: "مدیر عامل و موسس کسب و کار",
    text: "ممنون برای شام دیشب. شگفت‌انگیز بود!! من می‌گویم که این بهترین وعده غذایی است که در چند وقت اخیر خورده‌ام. قطعاً در سال آینده شاهد غذا خوردن بیشتری خواهیم بود :)",
    avatar: "/pages/menu_1/avatar01.jpg"
  },
  {
    name: "امیلیا امیلی",
    role: "مدیر عامل و موسس کسب و کار",
    text: "ممنون برای شام دیشب. شگفت‌انگیز بود!! من می‌گویم که این بهترین وعده غذایی است که در چند وقت اخیر خورده‌ام. قطعاً در سال آینده شاهد غذا خوردن بیشتری خواهیم بود :)",
    avatar: "/pages/menu_1/avatar01.jpg"
  },
  {
    name: "امیلیا امیلی",
    role: "مدیر عامل و موسس کسب و کار",
    text: "ممنون برای شام دیشب. شگفت‌انگیز بود!! من می‌گویم که این بهترین وعده غذایی است که در چند وقت اخیر خورده‌ام. قطعاً در سال آینده شاهد غذا خوردن بیشتری خواهیم بود :)",
    avatar: "/pages/menu_1/avatar01.jpg"
  },
  {
    name: "امیلیا امیلی",
    role: "مدیر عامل و موسس کسب و کار",
    text: "ممنون برای شام دیشب. شگفت‌انگیز بود!! من می‌گویم که این بهترین وعده غذایی است که در چند وقت اخیر خورده‌ام. قطعاً در سال آینده شاهد غذا خوردن بیشتری خواهیم بود :)",
    avatar: "/pages/menu_1/avatar01.jpg"
  },
  {
    name: "امیلیا امیلی",
    role: "مدیر عامل و موسس کسب و کار",
    text: "ممنون برای شام دیشب. شگفت‌انگیز بود!! من می‌گویم که این بهترین وعده غذایی است که در چند وقت اخیر خورده‌ام. قطعاً در سال آینده شاهد غذا خوردن بیشتری خواهیم بود :)",
    avatar: "/pages/menu_1/avatar01.jpg"
  }
];